package com.heaven7.algo;

/**
 * 1, tank: 团结状态- 众志成成(牺牲部分个人，转向集体)， 夫妻？
 *   生气 ？
 *   暴怒
 *   贪欲 ？ 吃掉敌人 -吸血 ?.
 *   同归于尽. 自杀爆炸一定范围内的所有可爆炸物.
 *   职业： 建造大师(构建墙体防御- 根据吃的buff决定构建的类型). 水师
 *   buff自己吃不了-> 推动buff到家里，给族人吃.
 *   每个都有： 攻击和防御数值.
 *   玩家击杀后可以吸收敌人状态或者天赋。（最多只能保持2个. 根据时间，状态会衰减）
 *   天赋: 速度，力量，跳跃, 联合（团结）, buff, -debuf.
 */
public class Think {
}
/*
傲慢 (Pride)：被认为是七宗罪中最根本、最严重的罪。它表现为过度的自爱和自我中心，轻视他人，将自己的价值置于一切之上。
嫉妒 (Envy)：因他人的优点、财富或地位而感到痛苦，并渴望将其占为己有，甚至希望他人失去这些好东西。
愤怒 (Wrath)：因感受到真实的或想象中的伤害，而产生失控的憎恨与报复心理。
怠惰 (Sloth)：指精神上的懒散和疏忽，逃避身体和灵性上的责任，是心灵上的一种“懈怠”。
贪婪 (Greed)：对财富、权力或物质享受的过度、无序的渴求，永不满足。
暴食 (Gluttony)：沉溺于口腹之欲，对食物或饮料的消耗远超自身需求。
色欲 (Lust)：对不合法（如婚姻之外的）性快感的无序欲望
* */